// 31. Вывести на экран кубы чисел от 1 до N

int N=10;
for(int i=1;i<=Т;i++)
System.Console.WriteLine($"{i} {i*i*i}");
