// 9. Вывести на экран четные числа от 1 до N
int i = 2;
int N = 10;
//нц  пока i<=N
// кц
while (i <= N)
{
  Console.WriteLine(i);
  i = i + 2;
}
