// 6. Написать программу вычисления значения функции y = sin(a). (Класс Math). 
double a;
Console.Write("Введите аргумент а:");
a = Convert.ToDouble(Console.ReadLine());
Console.WriteLine(Math.Sin(a));