// 8. Вывести на экран числа от -N до N
int n;
Console.Write("Введите целое число:");
n = Convert.ToInt32(Console.ReadLine());
for ()
{
  
}

Console.WriteLine($"{d0}");
